# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2023-11-28 20:33:33 krylon>
#
#+TAGS: go(g) internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Vox
  Vox is an audio book reader that saves your listening progress.
* Clocktable
  #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
  #+CAPTION: Clock summary at [2023-11-27 Mo 23:40]
  | Headline                | Time       |         |      |
  |-------------------------+------------+---------+------|
  | *Total time*            | *1d 23:05* |         |      |
  |-------------------------+------------+---------+------|
  | *Components [0/0]*      | *1d 23:05* |         |      |
  | \_  /Database [0/1]/    |            | /14:32/ |      |
  | \_    Data types        |            |         | 2:35 |
  | \_  /Scanner [0/0]/     |            | /1:03/  |      |
  | \_  /Player [0/1]/      |            | /8:39/  |      |
  | \_    Playlist [0/0]    |            |         | 0:30 |
  | \_  /UI [0/1]/          |            | /22:51/ |      |
  | \_    Managing Programs |            |         | 2:27 |
  #+END:
* Components [0/0]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
** Database [0/1]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
   :LOGBOOK:
   CLOCK: [2023-11-04 Sa 18:05]--[2023-11-04 Sa 20:50] =>  2:45
   CLOCK: [2023-11-03 Fr 17:46]--[2023-11-03 Fr 20:31] =>  2:45
   CLOCK: [2023-11-02 Do 20:17]--[2023-11-02 Do 21:37] =>  1:20
   CLOCK: [2023-10-29 So 16:35]--[2023-10-29 So 18:55] =>  2:20
   CLOCK: [2023-10-28 Sa 21:15]--[2023-10-28 Sa 23:44] =>  2:29
   CLOCK: [2023-10-28 Sa 15:47]--[2023-10-28 Sa 16:05] =>  0:18
   :END:
*** TODO Data types
    :LOGBOOK:
    CLOCK: [2023-10-31 Di 19:24]--[2023-10-31 Di 20:31] =>  1:07
    CLOCK: [2023-10-26 Do 22:45]--[2023-10-27 Fr 00:01] =>  1:16
    CLOCK: [2023-10-26 Do 17:55]--[2023-10-26 Do 18:07] =>  0:12
    :END:
    I copied the database schema over from my last attempt in Go, now I need
    to change my data types accordingly. :-|
** Scanner [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
   :LOGBOOK:
   CLOCK: [2023-11-06 Mo 18:51]--[2023-11-06 Mo 19:33] =>  0:42
   CLOCK: [2023-11-06 Mo 13:14]--[2023-11-06 Mo 13:35] =>  0:21
   :END:
** Player [0/1]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
   :LOGBOOK:
   CLOCK: [2023-11-20 Mo 20:31]--[2023-11-20 Mo 21:00] =>  0:29
   CLOCK: [2023-11-20 Mo 20:21]--[2023-11-20 Mo 20:31] =>  0:10
   CLOCK: [2023-11-20 Mo 19:12]--[2023-11-20 Mo 20:20] =>  1:08
   CLOCK: [2023-11-18 Sa 18:28]--[2023-11-18 Sa 21:35] =>  3:07
   CLOCK: [2023-11-18 Sa 16:41]--[2023-11-18 Sa 17:55] =>  1:14
   CLOCK: [2023-11-16 Do 20:30]--[2023-11-16 Do 22:31] =>  2:01
   :END:
*** TODO Playlist [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2023-11-28 Di 15:48]--[2023-11-28 Di 20:33] =>  4:45
    CLOCK: [2023-11-27 Mo 22:51]--[2023-11-27 Mo 23:21] =>  0:30
    :END:
** UI [0/1]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
   :LOGBOOK:
   CLOCK: [2023-11-22 Mi 18:15]--[2023-11-22 Mi 21:15] =>  3:00
   CLOCK: [2023-11-20 Mo 21:00]--[2023-11-20 Mo 22:39] =>  1:39
   CLOCK: [2023-11-14 Di 20:18]--[2023-11-14 Di 23:33] =>  3:15
   CLOCK: [2023-11-14 Di 15:02]--[2023-11-14 Di 16:17] =>  1:15
   CLOCK: [2023-11-13 Mo 22:23]--[2023-11-14 Di 00:06] =>  1:43
   CLOCK: [2023-11-11 Sa 18:34]--[2023-11-11 Sa 21:04] =>  2:30
   CLOCK: [2023-11-10 Fr 21:08]--[2023-11-10 Fr 23:25] =>  2:17
   CLOCK: [2023-11-08 Mi 18:38]--[2023-11-08 Mi 19:45] =>  1:07
   CLOCK: [2023-11-08 Mi 09:28]--[2023-11-08 Mi 11:14] =>  1:46
   CLOCK: [2023-11-07 Di 19:34]--[2023-11-07 Di 21:26] =>  1:52
   :END:
*** TODO Managing Programs
    :LOGBOOK:
    CLOCK: [2023-11-21 Di 17:15]--[2023-11-21 Di 19:42] =>  2:27
    :END:
* Bugs

